app/controllers/api/projects_controller.rb

    def create
        # debugger
        @project = Project.new(project_params)
        # @project.team_id = 1
        @project.user_id = current_user.id
        # @project = Project.new(name: 'test', description: 'testdes', user_id: 33, team_id: 1)

        if @project.save
---
INSERT INTO "projects" ("name", "description", "user_id", "created_at", "updated_at", "team_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "dfadsfdasfasf"], ["description", "asdfdasfdasfas"], ["user_id", 33], ["created_at", "2020-04-16 16:23:30.746984"], ["updated_at", "2020-04-16 16:23:30.746984"], ["team_id", 1]]

    def destroy
        @project = Project.find(params[:id])
        if  @project
            @project.destroy
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 1]]